// المسألة الأولي 
// فانكشن تحسب المتوسط الحسابي لمجموعة من الارقام لايقل عددهم عن 10 


// أول طريقة 
function mean(a,b,c,d,e,f,g,h,i,j){
    console.log((a+b+c+d+e+f+g+h+i+j)/10)
}
console.log(mean(2,3,5,2,53,3,8,6,9,3))    // سيتم طباعة 9.4


// تاني طريقة 
function mean(a,b,c,d,e,f,g,h,i,j){
    var meaning = a+b+c+d+e+f+g+h+i+j
    var num = 10
    var total = meaning / num
    return total
}
console.log(mean(2,3,5,2,53,3,8,6,9,3))   // سيتم طباعة 9.4


// تالت طريقة 
function mean(a,b,c,d,e,f,g,h,i,j){
    return (a+b+c+d+e+f+g+h+i+j) / 10 
}
var x = mean(2,3,5,2,53,3,8,6,9,3)
console.log(x)                            // سيتم طباعة 9.4





//________________________________________________________________________________________





//  المسألة الثانية 
//  فانكشن تاخد ارتفاع وقاعدة المثلث وترجع المساحة 


//أول طريقة 
function area(base,height){
    var CalcArea = ((base*height)/2)      
    return CalcArea
}
console.log(area(15,8))                  // هيطبع 60





//________________________________________________________________________________________






// المسألة الـثـالـثـة
// فانكشن تاخد العمر وترجعه بالايام


// أول طريقة حـسـاب العمر  ((  بالأيام  )) 
function calcAgeByDays(age){
    return (age*365)
}
var Age = calcAgeByDays(21)               
console.log(Age)                         // هيطبع 7665


// في متغير Age تاني طريقة حساب العمر  ((  بالساعات  )) وهنحتاج الطريقة الاولي علشان كدة حطيت ال 
function calcAgeByHours(age){
    return (age*24)
}
var x = calcAgeByHours(Age)
console.log(x)                            // هيطبع 183960






//________________________________________________________________________________________






// الـمـسـألـة الرابــعــة
// اعمل فانكشن تاخد رقمين وترجع مجموعهم 


function give(a,b){
    return a+b
}
console.log(give(10,20))                     // هتطلع 30






//________________________________________________________________________________________






// المسألة الـخـامـسـة
// ثم تعرض اول عنصر  array اعمل فانكشن تاخد اكتر من 10 اسامي داخل ال 


function arr(){
    var x = ['ahmed', 'ali', 'youssef', 'asmaa', 'hamdi', 'khaled', 'adham', 'adam', 'abdo', 'aya']
    return x[0]
}
console.log(arr())        // ahmed هتطبع 






//________________________________________________________________________________________







// الـمـسـألـة الـسـادسـة
// HTML اعمل فانكشن تعرض اسمك كامل في صفحة ال

function ShowName(Name){
    return Name
}
document.getElementById("name").innerHTML=ShowName('hamdi')






//________________________________________________________________________________________








// الــمـــســـألـــة الــســابـــعـــة
// اعمل فانشكن تحول الساعات الي ثواني 

function convert(hours){
    var Minutes = hours*60
    var Second = Minutes*60
    return Second
}
console.log(convert(2)+' Second')                     // 7200 Second هبطيع 







//_________________________________________________________________________________________








// المــســألة الـثـامـنة
// html document اعمل فانكشن تاخد اربع ارقام وترجع مجموعهم لو اكتر من 350 اظهر ترو و لو اقل من 250 اظهر فولس والعرض يكون علي ال 

function SumNum(num1,num2,num3,num4){
    if((num1+num2+num3+num4)>350){
        return true
    }
    else if((num1+num2+num3+num4)<350){
        return false
    }
}
document.getElementById('one').innerHTML=SumNum(10,20,30,300)          // هيرجعلي true







//_________________________________________________________________________________________







// المــســألة الـتـاسـعـة
// false عكس كدة ترجع  true اعمل فانكشن تاخد رقم لو بيساوي صفر ترجع 

function equlaize(num){
    if(num==0){
        return true
    }
    else{
        return false
    }
}
console.log(equlaize(0))             // لان الرقم هنا 0 true  هترجع 







//_________________________________________________________________________________________







// المـسـألة الـعـاشـرة 
// عمل فانكشن تاخد رقمين وتحسب باقي القسمة

function test(a,b){
    var total = a%b
    return total
}
console.log(test(20,3))       // هتطلع 2 لان باقي القسمة هنا هو 2







//_________________________________________________________________________________________






// المسألة ال11
// اعمل فانكشن تاخد رقمين وتطبع الرقم الاكبر واذا كانوا متساويين تطبع انهم متساويين

function test(a,b){
    if(a>b){
        return a
    }
    else if(b>a){
        return b
    }
    else{
        return 'equal'
    }
}
console.log(test(20,20))        // equall هيطبع 







//_________________________________________________________________________________________































